Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: If you are running this on a the HTML5 or PC and Mac modules then this value is updated constantly, as long as the device (usually a mouse) is plugged in, however for mobile devices, this will only be updated while the screen is being touched and note that the maximum number of touches that can be detected will depend very much on the device being used and the OS it runs.
zh_cn: 如果你是在HTML5或PC和Mac模块上运行此函数，那么只要设备(通常是鼠标)插入，这个值就会不断更新，但对于移动设备，这个值只会在触碰屏幕时更新，注意可以检测到的触碰的最大次数将取决于所使用的设备及其运行的操作系统。

source: If you are running this on a the HTML5 or PC and Mac modules then this value is updated constantly, as long as the device (usually a mouse) is plugged in, however for mobile devices, this will only be updated while the screen is being touched, and note that the maximum number of touches that can be detected will depend very much on the device being used and the OS it runs.
zh_cn: 如果您在HTML5或PC和Mac模块上运行此函数，则只要设备(通常是鼠标)插上电源，此值就会不断更新，但是对于移动设备，它只会在屏幕被触摸时更新，注意，可以检测到的最大触摸次数在很大程度上取决于所使用的设备及其运行的操作系统。

source: If you are using multiple views then the function should be used in the Draw Event and you can use the variable view_current to selectively apply the given camera only to the camera view currently being rendered.
zh_cn: 如果您正在使用多个视图，那么应该在绘制事件中使用此函数，并且您可以使用变量view_current来选择性地将给定的相机仅应用于当前正在渲染的相机视图。

source: If you are writing a file to disk, working_directory points to the area of local storage that is reserved for your game on the target device (in windows this is "%LOCALAPPDATA%/gamedir/" where the "gamedir" is the directory with the name of your game).
zh_cn: 如果您正在将文件写入磁盘，working_directory将指向目标设备上为您的游戏保留的本地存储区域(在windows中，这是"%LOCALAPPDATA%/gamedir/"，其中"gamedir"是包含您的游戏名称的目录)。

source: If you call this function on a path asset, then the removal of the point will be permanent and all instances assigned the path in the future will be missing the point that was removed. If this is not what you require, then you should use a function like path_duplicate() to create a copy of the path first, then call this function on the duplicated asset (don't forget to call path_delete() on the asset when it is no longer required).
zh_cn: 如果您在路径资源上调用此函数，那么点的删除将是永久的，并且将来分配了该路径的所有实例都将缺少被删除的点。如果这不是您所需要的，那么您应该首先使用一个类似path_duplicate()的函数来创建路径的副本，然后在复制的资源上调用此函数(不要忘记在不再需要它时在资源上调用path_delete())。

source: If you create a new layer through code using the function layer_create() then that function will return the unique ID value instead (dynamical created layers do not get names).
zh_cn: 如果你通过layer_create()函数创建一个新层，那么此函数将返回唯一的ID值(动态创建的层不会获得名称)。

source: If you created that surface using surface_create(), then this will be the positive integer which is the unique ID for that surface
zh_cn: 如果你使用surface_create()创建表面，那么这将是正整数，它是表面的唯一ID

source: If you do not call this function, nothing will be drawn as this effectively tells GameMaker that you have finished and that it can now draw the defined primitive.
zh_cn: 如果你不调用此函数，就不会绘制任何东西，因为这会有效地告诉GameMaker你已经完成了，它现在可以绘制定义的图元了。

source: If you do not need the id of the colliding instance you should consider using position_meeting() instead.
zh_cn: 如果您不需要碰撞实例的id，您应该考虑使用position_meeting()来代替。

source: If you do not specify the name of the layer, then the created layer will be assigned a name with the format "_layer_XXX", where "XXX" is a hex value used to give the layer a unique name.
zh_cn: 如果不指定层的名称，则创建的层将被指定一个格式为"_layer_XXX"的名称，其中"XXX"是一个十六进制值，用于给层一个唯一的名称。

source: If you do not supply a clear colour argument, the default colour of black will be used.
zh_cn: 如果不提供颜色参数，将使用默认的黑色。

source: If you do not use the function after you have used any of the ini write functions, then nothing will be written to disk, as the file information is held in memory until this function is called, which forces the write.
zh_cn: 如果在使用了任何ini写函数后不使用此函数，则不会向磁盘写入任何内容，因为文件信息会保存在内存中，直到调用此函数时才会强制写入。

source: If you do not use this function (the default setting) then the GUI layer will be positioned with its (0,0) point at the same position as that for the application surface (the area where your game is being drawn) and the width and height will be stretched to fit the this surface, such that setting a GUI width of 256px with this function when the application surface is 512px would stretch those 256 pixels to fit, effectively making the pixels twice as large.
zh_cn: 如果你不使用此函数(默认设置)，那么GUI层的(0,0)点将被定位在与应用程序表面(绘制游戏的区域)相同的位置，宽度和高度将被拉伸以适应这个表面，因此当应用程序表面为512像素时，使用此函数设置256像素的GUI宽度将拉伸这256像素以适应，有效地使像素增加一倍。

source: If you do supply the extra value for initialising the array, then all indices within the new array will be set to that instead of 0, but note that the function will have a greater performance overhead in this case.
zh_cn: 如果您为初始化数组提供了额外的值，那么新数组中的所有索引都将被设置为该值，而不是0，但是注意，在这种情况下，此函数的性能开销会更大。

source: If you enable the window resize option in the Game Options for the target platform, then the player can resize the game window to any size they wish, however by using this function you can limit the maximum height to the size you specify.
zh_cn: 如果你在目标平台的Game Options中启用窗口调整选项，那么玩家就可以将游戏窗口调整到任何他们想要的大小，但是通过使用此函数，你可以将最大高度限制为你指定的大小。

source: If you enable the window resize option in the Game Options for the target platform, then the player can resize the game window to any size they wish, however by using this function you can limit the maximum width to the size you specify.
zh_cn: 如果你在目标平台的Game Options中启用窗口调整选项，那么玩家就可以将游戏窗口调整到任何他们想要的大小，但是通过使用此函数，你可以将最大宽度限制为你指定的大小。

source: If you enable the window resize option in the Game Options for the target platform, then the player can resize the game window to any size they wish, however by using this function you can limit the minimum height to the size you specify.
zh_cn: 如果你在目标平台的Game Options中启用窗口调整选项，那么玩家就可以将游戏窗口调整为任何他们想要的大小，但是通过使用此函数，你可以将最小高度限制为你指定的大小。

source: If you enable the window resize option in the Game Options for the target platform, then the player can resize the game window to any size they wish, however by using this function you can limit the minimum width to the size you specify.
zh_cn: 如果您在目标平台的游戏选项中启用了窗口调整选项，那么玩家可以将游戏窗口调整到他们想要的任何大小，但是通过通过此函数，您可以将最小宽度限制为您指定的大小。

source: If you give a value of -1 as the camera ID then you are removing a camera from the view port and note that if that view port is enabled and visible you may get some unpredictable results.
zh_cn: 如果你给相机ID的值是-1，那么你就是在从视图端口中删除一个相机，注意，如果视图端口是启用的并且可见的，你可能会得到一些不可预知的结果。

source: If you give a value of -1, the element will have no sprite assigned (but will still exist and can have a sprite assigned again later).
zh_cn: 如果给定的值为-1，该元素将不会被赋予sprite(但是仍然存在，并且可以在以后再次被赋予sprite)。

source: If you have a larger or smaller port size than that assigned to the camera, then the camera view will be scaled down - or up - to fit, as illustrated by the image below.
zh_cn: 如果您的端口大小大于或小于分配给相机的端口大小，则相机视图将会缩小或放大以适应需要，如下图所示。

source: If you have created an external function call to a dll or dylib using external_define(), you can use this function to then call it.
zh_cn: 如果使用external_define()创建了对dll或dylib的外部函数调用，则可以使用此函数调用它。

source: If you have only read information from the ini file, then the default values for the read function will be returned, but the ini file will not actually be created.
zh_cn: 如果您只从ini文件中读取信息，那么read函数的默认值将被返回，但是ini文件实际上不会被创建。

source: If you have previously created an audio stream from a file using the function audio_create_stream() and no longer need that sound, you can call this function to delete it from memory.
zh_cn: 如果您之前已经使用函数audio_create_stream()从文件中创建了一个音频流，并且不再需要该声音，那么可以调用此函数从内存中删除它。

source: If you have set the camera to a view port through the Room Editor, this variable will hold the camera ID for that port.
zh_cn: 如果您已经通过Room Editor将相机设置为一个视图端口，那么该变量将保存该端口的相机ID。

source: If you have view ports set to visible and then disable this option, the whole room will be drawn to the screen scaled to the window size instead of the different cameras being drawn through the view ports.
zh_cn: 如果将视图端口设置为可见，然后禁用此选项，则整个房间将被绘制到按窗口大小缩放的屏幕上，而不是通过视图端口绘制不同的相机。

source: If you imagine a circle around your instance, and then imagine a point anywhere on that circle, to move to that point we need to move the object so many pixels in that direction... so this function (when used with lengthdir_x()) gets the position of that point on the circle to be used in code by the instance.
zh_cn: 如果你想象你的实例周围有一个圆，然后想象这个圆上的任意一个点，为了移动到那个点，我们需要在那个方向上移动对象这么多像素...因此，此函数(当与lengthdir_x()一起使用时)获得了该点在圆上的位置，供实例在代码中使用。

source: If you imagine a circle around your instance, and then imagine a point anywhere on that circle, to move to that point we need to move the object so many pixels in that direction... so this function (when used with lengthdir_y()) gets the position of that point on the circle to be used in code by the instance.
zh_cn: 如果你想象你的实例周围有一个圆，然后想象这个圆上的任意一个点，为了移动到那个点，我们需要在那个方向上移动对象这么多像素...因此，此函数(当与lengthdir_y()一起使用时)获得了该点在圆上的位置，供实例在代码中使用。

source: If you know, or suspect, that a string may have other characters then you can use string_digits() to remove all non-numeric characters, before using this function to turn the resulting string into a real number.
zh_cn: 如果您知道或怀疑一个字符串可能有其他字符，那么您可以使用string_digits()删除所有非数字字符，然后使用此函数将结果字符串转换为实数。

source: If you multiply a number with itself, you get the square of that number, but sometimes you want to do the reverse and get the square root of a number.
zh_cn: 如果你把一个数和它本身相乘，你会得到这个数的平方，但是有时候你想反过来得到这个数的平方根。

source: If you need the data from the current pose, use skeleton_bone_state_get().
zh_cn: 如果需要当前姿势的数据，请使用skeleton_bone_state_get()。

source: If you need the un-scaled height you should use sprite_get_height().
zh_cn: 如果你需要未缩放的高度，你应该使用sprite_get_height()。

source: If you need the un-scaled width you should use sprite_get_width().
zh_cn: 如果你需要未缩放的宽度，你应该使用sprite_get_width()。

source: If you need the un-scaled xoffset you should use sprite_get_xoffset().
zh_cn: 如果你需要未缩放的xoffset，你应该使用sprite_get_xoffset()。

source: If you need the un-scaled yoffset you should use sprite_get_yoffset().
zh_cn: 如果你需要未缩放的yoffset，你应该使用sprite_get_yoffset()。

source: If you need the unique index for the asset, then you can use the function asset_get_index() along with the returned name.
zh_cn: 如果您需要资源的惟一索引，那么您可以使用函数asset_get_index()和返回的名称。

source: If you need to check a continuous press of the button you should be using the function gamepad_button_check().
zh_cn: 如果你需要检查按钮的连续按下，你应该使用函数gamepad_button_check()。

source: If you need to get the data for a tile at a specific room position then you need to use the function tilemap_get_at_pixel().
zh_cn: 如果需要获取特定房间位置的tilemap的数据，则需要使用函数tilemap_get_at_pixel()。

source: If you need to get the tile data from a specific tile cell you should be using the function tilemap_get() instead.
zh_cn: 如果需要获取特定房间位置的tilemap的数据，则需要使用函数tilemap_get_at_pixel()。

source: If you need to get the unique instance id if the object being collided with you should use instance_position().
zh_cn: 如果你需要得到唯一的实例id，如果物体被碰撞，你应该使用instance_position()。

source: If you need to know whether a given sound index is for streamed audio or not you can use this function which will return 1 for streamed, 0 for sound in memory, and -1 if there is any error or the index does not point to a valid sound resource.
zh_cn: 如果你需要知道一个给定的声音索引是否为流音频，你可以使用此函数，它将返回1为流音频，0为内存中的声音，和-1，如果有任何错误或索引没有指向有效的声音资源。

source: If you pass invalid grid coordinates to the function, then the value returned will be undefined and an error will be shown in the output window.
zh_cn: 如果将无效的网格坐标传递给函数，则返回值将是未定义的，并且将在输出窗口中显示错误。

source: If you provide an incorrect listener index then the function will return -1.
zh_cn: 如果您提供了不正确的侦听器索引，那么此函数将返回-1。

source: If you require messages to be displayed when not in debug mode, then you should be using show_debug_message().
zh_cn: 如果您需要在不处于调试模式时显示消息，那么您应该使用show_debug_message()。

source: If you require more decimal places, then use the function string_format().
zh_cn: 如果需要更多的小数位，那么使用函数string_format()。

source: If you select either automatic (0) or full image (1) as the bounding box mode then the individual bounding box values can be set to 0.
zh_cn: 如果选择自动(0)或完整图像(1)作为边界框模式，则单个边界框值可以设置为0。

source: If you set a value greater than 360 this will be looped to bring it within the 0 - 359 range.
zh_cn: 如果你设置的值大于360，这将循环使其在0 - 359范围内。

source: If you set a value outside of the range of sub-images, then the image index will loop around.
zh_cn: 如果您设置的值超出了子图像的范围，那么图像索引将会循环。

source: If you set the gravity to 0, then no gravity will be applied to the instance (this is the default value).
zh_cn: 如果将重力设置为0，则不会将重力应用到实例(这是默认值)。

source: If you set them to the same value the particles will all be created with the same orientation.
zh_cn: 要使所有粒子具有相同的寿命，请将这两个值设置为相同。

source: If you set them to the same value the particles will only move in one direction.
zh_cn: 如果将它们设置为相同的值，粒子将只向一个方向移动。

source: If you set this on an instance that was previously static (ie: it has a density of 0) it will become a kinematic object and begin rotating
zh_cn: 如果你将此设置在一个以前是静态的实例上(例如:它的密度为0)，它将成为一个运动对象并开始旋转

source: If you set this value to 0, then there is no cap the particles created, and setting it to any other value will stop any further particles being created when the total number of particles is equal to the value.
zh_cn: 如果将该值设定为0，则创建的粒子没有上限，如果将该值设定为任何其他值，当粒子总数等于该值时，将停止创建任何更多的粒子。

source: If you supply a value outside of this range, the animation will be looped to make up the difference, for example if the animation has 5 frames and you set the frame to 8, the actual frame shown will be 3.
zh_cn: 如果您提供一个超出此范围的值，动画将循环播放以弥补差异，例如，如果动画有5帧，而您将帧设置为8，则显示的实际帧将为3。

source: If you supply a value outside of this range, the animation will be looped to make up the difference, for example if the given position is 1.5 the actual position will be 0.5.
zh_cn: 如果您提供一个超出此范围的值，动画将会循环以弥补差异，例如，如果给定位置是1.5，则实际位置将是0.5。

source: If you supply an asset index value, then you will need to supply the optional asset type argument (a constant), as assets of different types can have the same index, even though they cannot have the same name.
zh_cn: 如果您提供一个资源索引值，那么您将需要提供可选的资源类型参数(一个常量)，因为不同类型的资源可以具有相同的索引，即使它们不能具有相同的名称。

source: If you switch off automatic drawing then you need to handle this yourself, using the following code (for example):
zh_cn: 如果您关闭了自动绘制，那么您需要自己使用以下代码来处理这个问题(例如):

source: If you switch this on then the z-buffer is tested to see whether an object will be "visible" and not drawn if it's not.
zh_cn: 如果你打开这个开关，那么z-buffer就会被测试，看看一个对象是否"可见"，如果它不可见就不会被绘制。

source: If you think about any rotating object in the "real world", unless it has a motor or is in space, it slows down over time due to the influence of external forces (like friction with the air around it).
zh_cn: 如果你想象一下"现实世界"中的任何旋转物体，除非它有发动机或在太空中，否则它会随着时间的推移，由于外力(如与周围空气的摩擦)的影响而减速。

source: If you try to open an ini without having previously closed another one (or the same one) you will get an error too.
zh_cn: 如果你试图在没有关闭另一个ini的情况下打开它，你也会得到一个错误。

source: If you use this function to change the size of the game window, the contents of the window will be scaled to fit with a 1:1 ratio to the background canvas which will keep the image crisp and clear (although scaled if the window is other than the room or view size).
zh_cn: 如果您通过此函数来更改游戏窗口的大小，窗口的内容将按1:1的比例缩放以适应背景画布，这将保持图像清晰明了(尽管如果窗口不是房间或视图大小，也会进行缩放)。

source: If you use this function with HTML5 or are getting an image from a URL, this function will also generate an Image Loaded asynchronous event.
zh_cn: 如果你在HTML5中使用此函数或者从一个URL中获取一个图像，此函数也会产生一个图像加载异步事件。

source: If you want the group to loop then pass in true, otherwise pass in false, but note that if you want them to loop, all the tracks added later need to be the same length.
zh_cn: 如果你想让这个组循环，那么传入true，否则传入false，但是注意，如果你想让它们循环，所有后来添加的轨道需要长度相同。

source: If you want to create a sophisticated mechanical contraption you might want to use gears.
zh_cn: 如果你想创造一个复杂的机械装置，你可能想使用齿轮。

source: If you wish to apply an angular force to an instance using torque, then you should be using the function physics_apply_torque().
zh_cn: 如果希望使用扭矩对实例施加角向力，则应使用函数physics_apply_torque()。

source: If you wish to change this value then you should use the function gc_target_frame_time().
zh_cn: 如果希望更改此值，则应该使用函数gc_target_frame_time()。

source: If you wish to create an instance in the current room you should be using the function instance_create_layer(). Note that calling this function on a room asset created in the Asset Browser will permanently add the instance to the room, and even calling game_restart() will not return the room to it's original state (only ending the game and opening it again will start with the room in its original state again).
zh_cn: 如果希望在当前房间中创建实例，应该使用函数instance_create_layer()。注意，对在资源浏览器中创建的房间资源调用此函数会将实例永久添加到房间中，即使调用game_restart()也不会将房间返回到其原始状态(只有结束游戏并再次打开它，房间才会再次以其原始状态开始)。

source: If you wish to ensure that the list is "truly" empty on create, then you should call ds_list_clear() after creating the list, which will then mean that any values returned for unpopulated list slots will be undefined, which you can then check consistently using the is_undefined() function.
zh_cn: 如果您希望在创建时确保列表"真正"为空，那么您应该在创建列表后调用ds_list_clear()，这将意味着为未填充的列表槽返回的任何值都将是未定义的，然后您可以使用is_undefined()函数进行一致的检查。

source: If you wish to ensure that the list is "truly" empty on create, then you should call ds_list_clear() after creating the list, which will then mean that any values returned for unpopulated list slots will be undefined.
zh_cn: 如果您希望在创建时确保列表"真正"为空，那么您应该在创建列表后调用ds_list_clear()，这将意味着为未填充的列表槽返回的任何值都将是未定义的。

source: If you wish to go back to the default behaviour (ie: no minimum), then use a value of -1.
zh_cn: 如果您希望返回默认行为(即:没有最小值)，那么使用-1值。

source: If you wish to place a path point at some other position that is not the end, you should use path_insert_point().
zh_cn: 如果您希望将路径点放置在非终点的其他位置，您应该使用path_insert_point()。

source: If you wish to simply change these values, you should be using the function motion_set().
zh_cn: 如果您希望简单地更改这些值，您应该使用函数motion_set()。

source: If your defined vertex format takes a colour value you can use this function to add that data to the vertex being defined for the current primitive.
zh_cn: 如果定义的顶点格式接受颜色值，则可以使用此函数将该数据添加到为当前图元定义的顶点。

source: If your game has different rooms or instances to control menus and game-play and other things, then it is probable that you will need to change the position and key maps of your virtual keys at some point.
zh_cn: 如果你的游戏有不同的房间或实例来控制菜单、游戏和其他东西，那么你可能需要在某个时候改变虚拟键的位置和键映射。

source: Image Loaded event
zh_cn: 图像加载事件

source: In GM all the trigonometric functions work in radians, but most people work in degrees and this means that to convert your degrees into radians you need to use this function.
zh_cn: 在GM中，所有的三角函数都以弧度表示，但大多数人以度表示，这意味着要将你的度转换成弧度，你需要使用此函数。

source: In GameMaker there are two main ways that can be used to tell the speed at which your game runs.
zh_cn: 在GameMaker中，有两种主要方法可以用来判断游戏的运行速度。

source: In a right angled triangle cos(val) = Adjacent / Hypotenuse where val is one of the three angles.
zh_cn: 在直角三角形中，cos(val) =邻边/斜边，其中val是三个角中的一个。

source: In a right angled triangle dsin(val) = Opposite / Hypotenuse where "val" is one of the three angles.
zh_cn: 在直角三角形中，dsin(val) =对边/斜边，其中"val"是三个角中的一个。

source: In a right angled triangle dtan(val) = Opposite / Adjacent where "val" is one of the three angles.
zh_cn: 在直角三角形中，dtan(val) =相对/相邻，其中"val"是三个角中的一个。

source: In a right angled triangle sin(val) = Opposite / Hypotenuse where val is one of the three angles.
zh_cn: 在直角三角形中，sin(val) =对边/斜边，其中val是三个角中的一个。

source: In a right angled triangle tan(val) = Opposite / Adjacent where val is one of the three angles.
zh_cn: 在直角三角形中，tan(val) =对边/邻边，其中val是三个角中的一个。

source: In computing, a post request is used when the client needs to send data to the server as part of the retrieval request, such as when uploading a file or submitting a completed form, and the same is true of this function in GameMaker.
zh_cn: 在计算中，当客户端需要向服务器发送数据作为检索请求的一部分时，例如上传文件或提交完成的表单时，就会使用post请求，GameMaker中的此函数也是如此。

source: In contrast to the http_get() request method where only a URL is sent to the server, http_post_string() also includes a string that is sent to the server and may result in the creation of a new resource or the update of an existing resource or both.
zh_cn: 与http_get()请求方法相比，http_post_string()还包括一个发送到服务器的字符串，可能会导致创建新资源或更新现有资源，或两者都有。

source: In cryptography, MD5 (Message-Digest algorithm 5) is a widely used cryptographic hash function with a 128-bit hash value and has been employed in a wide variety of security applications.
zh_cn: 在密码学中，MD5(消息摘要算法5)是一种广泛使用的加密哈希函数，其哈希值为128位，已被广泛应用于各种安全应用程序中。

source: In cryptography, MD5 (Message-Digest algorithm 5) is a widely used cryptographic hashing function with a 128-bit hash value and has been employed in a wide variety of security applications.
zh_cn: 在密码学中，MD5(消息摘要算法5)是一种广泛使用的具有128位散列值的加密散列函数，并且已经被广泛应用于各种安全应用中。

source: In cryptography, SHA-1 is a cryptographic hash function designed by the United States National Security Agency and is employed in several widely used applications and protocols like the popular Git where it is used to check for file changes.
zh_cn: 在密码学中，SHA-1是由美国国家安全局设计的一种加密散列函数，并在几种广泛使用的应用程序和协议中使用，如流行的Git，它用于检查文件更改。

source: In cryptography, SHA-1 is a cryptographic hash function designed by the United States National Security Agency and is employed in several widely used applications popular Git where it is used to check for file changes, and the protocols TLS and SSL, PGP, SSH, S/MIME, and IPsec.
zh_cn: 在密码学中，SHA-1是由美国国家安全局设计的一种加密散列函数，并且在几种广泛使用的应用程序中被采用，其中流行的Git用于检查文件改变，以及TLS和SSL、PGP、SSH、S/MIME和IPsec协议。

source: In cryptography, SHA-1 is a cryptographic hashing function designed by the United States National Security Agency and is employed in several widely used applications and protocols like the popular Git where it is used to check for file changes.
zh_cn: 在密码学中，SHA-1是由美国国家安全局设计的一种加密哈希函数，在一些广泛使用的应用程序和协议中使用，比如流行的Git，它用于检查文件更改。

source: In general it is much better practice to use room_goto() to change rooms.
zh_cn: 一般来说，更好的做法是使用room_goto()来改变房间。

source: In general it is only needed for freeing up memory that has been used by a font added to the game through the functions font_add() or font_add_sprite().
zh_cn: 一般来说，只需要释放通过函数font_add()或font_add_sprite()添加到游戏中的字体所使用的内存。

source: In general you do not need to worry about this, but if you have layers that have a depth outside of the legal range (-16000 to 16000) then they won't be rendered, so you can force the Z depth to a reasonable value - 0 for example - and they will all be rendered fine.
zh_cn: 一般来说，你不需要担心这个问题，但是如果你的图层深度超出了法定范围(-16000到16000)，那么它们就不会被渲染，所以你可以将Z深度强制设置为一个合理的值——例如0——它们都会被渲染得很好。

source: In general you would want to use this function on a path created using path_add(), since if you use it on a path asset, it will permanently affect the path for all instances in the game from the moment the function is used until the end of the game.
zh_cn: 一般来说，您会希望在使用path_add()创建的路径上使用此函数，因为如果您在路径资源上使用此函数，它将永久影响游戏中所有实例的路径，从使用此函数的时刻开始，直到游戏结束。

source: In general you would want to use this function on paths created using path_add(), since if you use it on a path asset, it will permanently affect the path for instances in the game from the moment the function is used until the end of the game.
zh_cn: 一般来说，您会希望在使用path_add()创建的路径上使用此函数，因为如果您在路径资源上使用此函数，它将永久影响游戏中实例的路径，从使用此函数的那一刻起直到游戏结束。

source: In general, the keyboard will be cleared only for that step but the next step will again detect the key, however this may not be the same across all platforms and keyboards, and in some cases the function may act like it does for the mouse and require the key to be lifted and pressed again.
zh_cn: 一般来说，键盘将仅在该步骤被清除，但下一步骤将再次检测该键，然而这可能在所有平台和键盘上并不相同，并且在某些情况下，此函数可能像它对鼠标所做的那样，需要再次抬起并按下该键。
